{"backend": "tensorflow", "keras_version": "2.1.4", "class_name": "Model", "config": {"layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 96, 96, 3], "name": "input_1"}, "inbound_nodes": []}, {"name": "conv1", "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "trainable": true, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "name": "conv1", "dilation_rate": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv1_bn", "class_name": "BatchNormalization", "config": {"center": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "conv1_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "conv1_relu", "class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv1_relu"}, "inbound_nodes": [[["conv1_bn", 0, 0, {}]]]}, {"name": "conv_dw_1", "class_name": "DepthwiseConv2D", "config": {"use_bias": false, "padding": "same", "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "depthwise_constraint": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "name": "conv_dw_1", "dilation_rate": [1, 1], "depth_multiplier": 1, "depthwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["conv1_relu", 0, 0, {}]]]}, {"name": "conv_dw_1_bn", "class_name": "BatchNormalization", "config": {"center": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "conv_dw_1_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]]}, {"name": "conv_dw_1_relu", "class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_1_relu"}, "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]]}, {"name": "conv_pw_1", "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv_pw_1", "dilation_rate": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null}, "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]]}, {"name": "conv_pw_1_bn", "class_name": "BatchNormalization", "config": {"center": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "conv_pw_1_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]]}, {"name": "conv_pw_1_relu", "class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_1_relu"}, "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]]}, {"name": "conv_dw_2", "class_name": "DepthwiseConv2D", "config": {"use_bias": false, "padding": "same", "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "depthwise_constraint": null, "trainable": true, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "name": "conv_dw_2", "dilation_rate": [1, 1], "depth_multiplier": 1, "depthwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]]}, {"name": "conv_dw_2_bn", "class_name": "BatchNormalization", "config": {"center": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "conv_dw_2_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]]}, {"name": "conv_dw_2_relu", "class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_2_relu"}, "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]]}, {"name": "conv_pw_2", "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv_pw_2", "dilation_rate": [1, 1], "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null}, "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]]}, {"name": "conv_pw_2_bn", "class_name": "BatchNormalization", "config": {"center": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "conv_pw_2_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]]}, {"name": "conv_pw_2_relu", "class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_2_relu"}, "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]]}, {"name": "conv_dw_3", "class_name": "DepthwiseConv2D", "config": {"use_bias": false, "padding": "same", "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "depthwise_constraint": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "name": "conv_dw_3", "dilation_rate": [1, 1], "depth_multiplier": 1, "depthwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]]}, {"name": "conv_dw_3_bn", "class_name": "BatchNormalization", "config": {"center": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "conv_dw_3_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]]}, {"name": "conv_dw_3_relu", "class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_3_relu"}, "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]]}, {"name": "conv_pw_3", "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv_pw_3", "dilation_rate": [1, 1], "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null}, "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]]}, {"name": "conv_pw_3_bn", "class_name": "BatchNormalization", "config": {"center": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "conv_pw_3_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]]}, {"name": "conv_pw_3_relu", "class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_3_relu"}, "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]]}, {"name": "conv_dw_4", "class_name": "DepthwiseConv2D", "config": {"use_bias": false, "padding": "same", "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "depthwise_constraint": null, "trainable": true, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "name": "conv_dw_4", "dilation_rate": [1, 1], "depth_multiplier": 1, "depthwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]]}, {"name": "conv_dw_4_bn", "class_name": "BatchNormalization", "config": {"center": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "conv_dw_4_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]]}, {"name": "conv_dw_4_relu", "class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_4_relu"}, "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]]}, {"name": "conv_pw_4", "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv_pw_4", "dilation_rate": [1, 1], "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null}, "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]]}, {"name": "conv_pw_4_bn", "class_name": "BatchNormalization", "config": {"center": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "conv_pw_4_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]]}, {"name": "conv_pw_4_relu", "class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_4_relu"}, "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]]}, {"name": "conv_dw_5", "class_name": "DepthwiseConv2D", "config": {"use_bias": false, "padding": "same", "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "depthwise_constraint": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "name": "conv_dw_5", "dilation_rate": [1, 1], "depth_multiplier": 1, "depthwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]]}, {"name": "conv_dw_5_bn", "class_name": "BatchNormalization", "config": {"center": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "conv_dw_5_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]]}, {"name": "conv_dw_5_relu", "class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_5_relu"}, "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]]}, {"name": "conv_pw_5", "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv_pw_5", "dilation_rate": [1, 1], "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null}, "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]]}, {"name": "conv_pw_5_bn", "class_name": "BatchNormalization", "config": {"center": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "conv_pw_5_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]]}, {"name": "conv_pw_5_relu", "class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_5_relu"}, "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]]}, {"name": "conv_dw_6", "class_name": "DepthwiseConv2D", "config": {"use_bias": false, "padding": "same", "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "depthwise_constraint": null, "trainable": true, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "name": "conv_dw_6", "dilation_rate": [1, 1], "depth_multiplier": 1, "depthwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]]}, {"name": "conv_dw_6_bn", "class_name": "BatchNormalization", "config": {"center": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "conv_dw_6_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]]}, {"name": "conv_dw_6_relu", "class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_6_relu"}, "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]]}, {"name": "conv_pw_6", "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv_pw_6", "dilation_rate": [1, 1], "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null}, "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]]}, {"name": "conv_pw_6_bn", "class_name": "BatchNormalization", "config": {"center": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "conv_pw_6_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]]}, {"name": "conv_pw_6_relu", "class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_6_relu"}, "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]]}, {"name": "conv_dw_7", "class_name": "DepthwiseConv2D", "config": {"use_bias": false, "padding": "same", "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "depthwise_constraint": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "name": "conv_dw_7", "dilation_rate": [1, 1], "depth_multiplier": 1, "depthwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]]}, {"name": "conv_dw_7_bn", "class_name": "BatchNormalization", "config": {"center": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "conv_dw_7_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]]}, {"name": "conv_dw_7_relu", "class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_7_relu"}, "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]]}, {"name": "conv_pw_7", "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv_pw_7", "dilation_rate": [1, 1], "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null}, "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]]}, {"name": "conv_pw_7_bn", "class_name": "BatchNormalization", "config": {"center": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "conv_pw_7_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]]}, {"name": "conv_pw_7_relu", "class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_7_relu"}, "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]]}, {"name": "conv_dw_8", "class_name": "DepthwiseConv2D", "config": {"use_bias": false, "padding": "same", "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "depthwise_constraint": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "name": "conv_dw_8", "dilation_rate": [1, 1], "depth_multiplier": 1, "depthwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]]}, {"name": "conv_dw_8_bn", "class_name": "BatchNormalization", "config": {"center": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "conv_dw_8_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]]}, {"name": "conv_dw_8_relu", "class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_8_relu"}, "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]]}, {"name": "conv_pw_8", "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv_pw_8", "dilation_rate": [1, 1], "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null}, "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]]}, {"name": "conv_pw_8_bn", "class_name": "BatchNormalization", "config": {"center": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "conv_pw_8_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]]}, {"name": "conv_pw_8_relu", "class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_8_relu"}, "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]]}, {"name": "conv_dw_9", "class_name": "DepthwiseConv2D", "config": {"use_bias": false, "padding": "same", "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "depthwise_constraint": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "name": "conv_dw_9", "dilation_rate": [1, 1], "depth_multiplier": 1, "depthwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]]}, {"name": "conv_dw_9_bn", "class_name": "BatchNormalization", "config": {"center": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "conv_dw_9_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]]}, {"name": "conv_dw_9_relu", "class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_9_relu"}, "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]]}, {"name": "conv_pw_9", "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv_pw_9", "dilation_rate": [1, 1], "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null}, "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]]}, {"name": "conv_pw_9_bn", "class_name": "BatchNormalization", "config": {"center": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "conv_pw_9_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]]}, {"name": "conv_pw_9_relu", "class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_9_relu"}, "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]]}, {"name": "conv_dw_10", "class_name": "DepthwiseConv2D", "config": {"use_bias": false, "padding": "same", "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "depthwise_constraint": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "name": "conv_dw_10", "dilation_rate": [1, 1], "depth_multiplier": 1, "depthwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]]}, {"name": "conv_dw_10_bn", "class_name": "BatchNormalization", "config": {"center": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "conv_dw_10_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]]}, {"name": "conv_dw_10_relu", "class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_10_relu"}, "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]]}, {"name": "conv_pw_10", "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv_pw_10", "dilation_rate": [1, 1], "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null}, "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]]}, {"name": "conv_pw_10_bn", "class_name": "BatchNormalization", "config": {"center": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "conv_pw_10_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]]}, {"name": "conv_pw_10_relu", "class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_10_relu"}, "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]]}, {"name": "conv_dw_11", "class_name": "DepthwiseConv2D", "config": {"use_bias": false, "padding": "same", "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "depthwise_constraint": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "name": "conv_dw_11", "dilation_rate": [1, 1], "depth_multiplier": 1, "depthwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]]}, {"name": "conv_dw_11_bn", "class_name": "BatchNormalization", "config": {"center": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "conv_dw_11_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]]}, {"name": "conv_dw_11_relu", "class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_11_relu"}, "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]]}, {"name": "conv_pw_11", "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv_pw_11", "dilation_rate": [1, 1], "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null}, "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]]}, {"name": "conv_pw_11_bn", "class_name": "BatchNormalization", "config": {"center": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "conv_pw_11_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]]}, {"name": "conv_pw_11_relu", "class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_11_relu"}, "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]]}, {"name": "conv_dw_12", "class_name": "DepthwiseConv2D", "config": {"use_bias": false, "padding": "same", "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "depthwise_constraint": null, "trainable": true, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "name": "conv_dw_12", "dilation_rate": [1, 1], "depth_multiplier": 1, "depthwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]]}, {"name": "conv_dw_12_bn", "class_name": "BatchNormalization", "config": {"center": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "conv_dw_12_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]]}, {"name": "conv_dw_12_relu", "class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_12_relu"}, "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]]}, {"name": "conv_pw_12", "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv_pw_12", "dilation_rate": [1, 1], "filters": 1024, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null}, "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]]}, {"name": "conv_pw_12_bn", "class_name": "BatchNormalization", "config": {"center": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "conv_pw_12_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]]}, {"name": "conv_pw_12_relu", "class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_12_relu"}, "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]]}, {"name": "conv_dw_13", "class_name": "DepthwiseConv2D", "config": {"use_bias": false, "padding": "same", "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "depthwise_constraint": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "name": "conv_dw_13", "dilation_rate": [1, 1], "depth_multiplier": 1, "depthwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]]}, {"name": "conv_dw_13_bn", "class_name": "BatchNormalization", "config": {"center": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "conv_dw_13_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "inbound_nodes": [[["conv_dw_13", 0, 0, {}]]]}, {"name": "conv_dw_13_relu", "class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_13_relu"}, "inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]]}, {"name": "conv_pw_13", "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv_pw_13", "dilation_rate": [1, 1], "filters": 1024, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null}, "inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]]}, {"name": "conv_pw_13_bn", "class_name": "BatchNormalization", "config": {"center": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "conv_pw_13_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}, "inbound_nodes": [[["conv_pw_13", 0, 0, {}]]]}, {"name": "conv_pw_13_relu", "class_name": "Activation", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_13_relu"}, "inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]]}, {"name": "global_average_pooling2d_1", "class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "global_average_pooling2d_1", "data_format": "channels_last"}, "inbound_nodes": [[["conv_pw_13_relu", 0, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"target_shape": [1, 1, 1024], "trainable": true, "name": "reshape_1"}, "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]]}, {"name": "dropout", "class_name": "Dropout", "config": {"rate": 0.001, "noise_shape": null, "trainable": true, "name": "dropout", "seed": null}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"name": "conv_preds", "class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv_preds", "dilation_rate": [1, 1], "filters": 3036, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null}, "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"name": "act_softmax", "class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "act_softmax"}, "inbound_nodes": [[["conv_preds", 0, 0, {}]]]}, {"name": "reshape_2", "class_name": "Reshape", "config": {"target_shape": [3036], "trainable": true, "name": "reshape_2"}, "inbound_nodes": [[["act_softmax", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["reshape_2", 0, 0]], "name": "mobilenet_1.00_96"}}